#+title: Go 语言圣经
#+TAGS: 忽略(i) 没太懂(c) 笔记(n)
#+TODO: TODO(t) IGNORE(i) | NOTE(n) FINISH(f)

** TODO [[file:ch1/ch1-01.md][Hello, World]]

#+begin_src go :imports "fmt" :tangle codes/ch1/test.go
  fmt.Println("Hello, org-mode")
#+end_src

#+RESULTS:
: Hello, org-mode

#+begin_src sh :results output code :wrap src text

  cat codes/ch1/test.go
  echo '--------------------'

  go build  -o codes/ch1/test codes/ch1/test.go
  ls codes/ch1

  echo '------------'
  go run codes/ch1/test.go
#+end_src

#+RESULTS:
#+begin_src text
package main
import (
        "fmt"
)

func main() {
fmt.Println("Hello, org-mode")
}
--------------------
test
test.go
------------
Hello, org-mode
#+end_src

